let fnshed = function (begin, end) {
    let dt = new Date(); // Створюється новий об'єкт дати з поточним часом
    let msg = dt.toLocaleString(); // Отримання поточної дати і часу у вигляді рядка

    if (dt.getTime() >= end.getTime()) { // Перевірка, чи поточний час більше або дорівнює часу закінчення події
        clearTimeout(htmr); // Зупинка інтервалу, якщо подія закінчена
        msg = msg + ": Подію зупинено"; // Додавання повідомлення про закінчення події
    } else if (dt.getTime() >= begin.getTime()) { // Перевірка, чи поточний час більше або дорівнює часу початку події
        msg = msg + ": Подія працює"; // Додавання повідомлення про активну подію
    }
    
    console.log(msg); // Виведення повідомлення у консоль
}

let now = new Date(); // Створюється новий об'єкт дати з поточним часом
let begin = new Date(now.getTime() + 3000); // Визначається час початку події (через 3 секунди від поточного часу)
let end = new Date(now.getTime() + 8000); // Визначається час закінчення події (через 8 секунд від поточного часу)
htmr = setInterval(fnshed, 1000, begin, end); // Запускається інтервал, який викликає функцію fnshed кожну секунду з параметрами begin і end

console.log(now.toLocaleString() + " Планувальник запущено:"); // Виведення повідомлення про запуск планувальника
console.log("- початок події о " + begin.toLocaleString()); // Виведення часу початку події
console.log("- кінець події о " + end.toLocaleString()); // Виведення часу закінчення події
