// Змінна з ім'ям
let frstName = "Максим"; // вписати своє ім’я

// Змінна з прізвищем
let lastName = "Гречка"; // вписати своє прізвище

// Змінна з ніком на GitHub
let nick = "Devil19985"; // вписати нік на GitHub

// Змінна з віком
let age = 18; // вписати свій вік

// Змінна з вагою
let weight = 84; // вписати вагу (приблизно)

// Змінна з ростом
let hight = 1.85; // вписати свій ріст в метрах (приблизно)

// Змінна з днем народження
let birthday = ""; // залишити порожнім

// Змінна з сімейним станом
let marital = "не одружений"; // вписати одружений/заміжня

// Виведення остачі від ділення росту на 1
console.log(hight % 1); // 0.83

// Виведення результату порівняння росту > 1.80
let isHigh = hight > 1.80;
console.log(isHigh); 

// Виведення індексу маси тіла (IMT)
let IMT = weight / (hight ** 2);
console.log(IMT); 

// Визначення стану ваги
let IMTstate = (IMT >= 18.5 && IMT <= 24.9) ? "Вага нормальна" : "Вага поза нормою";
console.log(IMTstate); // стан ваги